Revit 2024 API
MultistoryStairs Class
 Represents a multistory stairs element in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class MultistoryStairs : Element
Visual Basic
Public Class MultistoryStairs _
	Inherits Element
Visual C++
public ref class MultistoryStairs : public Element
Remarks
A multistory stairs element may contain multiple stairs whose extents are governed by base and top levels. Use [M:Autodesk.Revit.DB.Architecture.MultistoryStairs.ConnectLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId})] and [M:Autodesk.Revit.DB.Architecture.MultistoryStairs.DisconnectLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId})] to add and remove connected levels to a multistory stairs element.
This element will contain one or more Stairs elements. These can be obtained via GetAllStairsIds() and GetStairsOnLevel(ElementId). Stairs elements are either a reference instance which is copied to each level covered by groups of identical stairs instances which share the same level height, or individual Stairs instances which are not connected to a group with the same level height. By default, when adding new levels to the multistory stair, new stairs will be added to the group (shown in the Revit user interface with a 'Pin' icon).
For groups of duplicate stairs at different levels, the instances can be found as Subelements of the Stairs element (see GetSubelements().
Stairs in a connected group can be edited together by modifying the associated Stairs instance. For specific floors that need special designs, stairs can be separated from a group by unpinning the element, changes made to this Stairs will not affect other any other instance in the element. Use Unpin(ElementId) for this.
You can add the stairs back into the group via Pin(ElementId) if needed. However, any changes made to the stair will be lost since the stair's properties will be overridden by the group specifications.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.MultistoryStairs
See Also
MultistoryStairs Members
Autodesk.Revit.DB.Architecture Namespace